app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["body", ""], ["post_id", 3], ["created_at", "2018-03-27 22:02:29.020168"], ["updated_at", "2018-03-27 22:02:29.020168"]]