app/controllers/posts_controller.rb

  def update
    @post =Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 21]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "I have edited the post: Bonjour"], ["updated_at", "2018-03-27 20:47:09.056223"], ["id", 21]]